- data: S&P_500_Index_01021980_12301988_raw_data.csv  
Change the column "Date" to datetime format

In [1]:
import numpy as np
import pandas as pd

In [2]:
snp_data = pd.read_csv('S&P_500_Index_01021980_12301988_raw_data.csv',
                       header = 0)
snp_data.head()

       Date    Open    High     Low   Close
0  12/30/88  277.72  279.78  277.72  277.72
1  12/29/88  279.40  279.42  277.08  279.40
2  12/28/88  277.08  277.55  276.17  277.08
3  12/27/88  276.83  278.09  276.74  276.83
4  12/23/88  277.87  277.99  276.87  277.87

In [3]:
snp_data.columns = [col.strip() for col in snp_data.columns]
snp_data.columns

Index(['Date', 'Open', 'High', 'Low', 'Close'], dtype='object')

change the type of "Date" column to datetime format

In [4]:
snp_data.dtypes

Date      object
Open     float64
High     float64
Low      float64
Close    float64
dtype: object

In [5]:
snp_data["Date"] = pd.to_datetime(snp_data["Date"], yearfirst=False,
                                  format="%m/%d/%y")
snp_data.dtypes

Date     datetime64[ns]
Open            float64
High            float64
Low             float64
Close           float64
dtype: object

In [6]:
snp_data

           Date    Open    High     Low   Close
0    1988-12-30  277.72  279.78  277.72  277.72
1    1988-12-29  279.40  279.42  277.08  279.40
2    1988-12-28  277.08  277.55  276.17  277.08
3    1988-12-27  276.83  278.09  276.74  276.83
4    1988-12-23  277.87  277.99  276.87  277.87
...         ...     ...     ...     ...     ...
2271 1980-01-08  108.95  108.95  108.95  108.95
2272 1980-01-07  106.81  106.81  106.81  106.81
2273 1980-01-04  106.52  106.52  106.52  106.52
2274 1980-01-03  105.22  105.22  105.22  105.22
2275 1980-01-02  105.76  105.76  105.76  105.76

[2276 rows x 5 columns]

save the file in csv format

In [7]:
snp_data.to_csv("./S&P_500_Index_01021980_12301988_preprocessed.csv",
                header = True, index=False)

In [8]:
snp_data.sort_values(by = 'Date', ascending = True).reset_index(drop=True)

           Date    Open    High     Low   Close
0    1980-01-02  105.76  105.76  105.76  105.76
1    1980-01-03  105.22  105.22  105.22  105.22
2    1980-01-04  106.52  106.52  106.52  106.52
3    1980-01-07  106.81  106.81  106.81  106.81
4    1980-01-08  108.95  108.95  108.95  108.95
...         ...     ...     ...     ...     ...
2271 1988-12-23  277.87  277.99  276.87  277.87
2272 1988-12-27  276.83  278.09  276.74  276.83
2273 1988-12-28  277.08  277.55  276.17  277.08
2274 1988-12-29  279.40  279.42  277.08  279.40
2275 1988-12-30  277.72  279.78  277.72  277.72

[2276 rows x 5 columns]